## Selecting columns
This chapter provides a brief introduction to working with relational databases. You'll learn about their structure, how to talk about them using database lingo, and how to begin an analysis using simple SQL commands to select and summarize columns from database tables.

### Onboarding | Query Result
Notice the query result tab in the bottom right corner of your screen. This is where the results of your SQL queries will be displayed.

Run this query in the editor and check out the resulting table in the query result tab!

SELECT name FROM people;

Who is the second person listed in the query result?

### Onboarding | Errors
If you submit the code to the right, you'll see that you get two types of errors.

SQL errors are shown below the editor. These are errors returned by the SQL engine. You should see:

syntax error at or near "'DataCamp <3 SQL'" LINE 2: 'DataCamp <3 SQL' ^

DataCamp errors are shown in the Instructions box. These will let you know in plain English where you went wrong in your code! You should see:

You need to add SELECT at the start of line 2!

Instructions:

Submit the code to the right, check out the errors, then fix them!

In [ ]:
-- Try running me!
SELECT 'DataCamp <3 SQL'
AS result;

### Onboarding | Multi-step Exercises
The following multi-step exercise allows you to practice a new concept through repetition. Check it out!

Instruction:

* Submit the query in the editor! Don't worry, you'll learn how it works soon.
* Now change 'SQL' to 'SQL is' and click Submit!
* Finally, change 'SQL is' to 'SQL is cool' and click Submit!

In [ ]:
SELECT 'SQL'
AS result;

In [ ]:
SELECT 'SQL is'
AS result;

In [ ]:
SELECT 'SQL is cool'
AS result;

### SELECTing single columns
While SQL can be used to create and modify databases, the focus of this course will be querying databases. A query is a request for data from a database table (or combination of tables). Querying is an essential skill for a data scientist, since the data you need for your analyses will often live in databases.

In SQL, you can select data from a table using a SELECT statement. For example, the following query selects the name column from the people table:

SELECT name

FROM people;

In this query, SELECT and FROM are called keywords. In SQL, keywords are not case-sensitive, which means you can write the same query as:

select name

from people;

That said, it's good practice to make SQL keywords uppercase to distinguish them from other parts of your query, like column and table names.

It's also good practice (but not necessary for the exercises in this course) to include a semicolon at the end of your query. This tells SQL where the end of your query is!

Remember, you can see the results of executing your query in the query tab!

Instructions:

* Select the title column from the films table.
* Select the release_year column from the films table.
* Select the name of each person in the people table.

In [ ]:
SELECT title from films;

In [ ]:
SELECT release_year from films;

In [ ]:
SELECT name from people;

### SELECTing multiple columns
Well done! Now you know how to select single columns.

In the real world, you will often want to select multiple columns. Luckily, SQL makes this really easy. To select multiple columns from a table, simply separate the column names with commas!

For example, this query selects two columns, name and birthdate, from the people table:

SELECT name, birthdate

FROM people;

Sometimes, you may want to select all columns from a table. Typing out every column name would be a pain, so there's a handy shortcut:

SELECT *

FROM people;

If you only want to return a certain number of results, you can use the LIMIT keyword to limit the number of rows returned:

SELECT *

FROM people

LIMIT 10;

Before getting started with the instructions below, check out the column names in the films table!

Instructions:

* Get the title of every film from the films table.
* Get the title and release year for every film.
* Get the title, release year and country for every film.
* Get all columns from the films table.

In [ ]:
SELECT title FROM films;

In [ ]:
SELECT title,release_year FROM films;

In [ ]:
SELECT title, release_year,country
FROM films;

In [ ]:
SELECT *
FROM films;

### SELECT DISTINCT
Often your results will include many duplicate values. If you want to select all the unique values from a column, you can use the DISTINCT keyword.

This might be useful if, for example, you're interested in knowing which languages are represented in the films table:

SELECT DISTINCT language

FROM films;

Remember, you can check out the data in the tables by clicking on the table nam

Instructions:

* Get all the unique countries represented in the films table.
* Get all the different film certifications from the films table.
* Get the different types of film roles from the roles table.

In [ ]:
SELECT DISTINCT country 
FROM films;

In [ ]:
SELECT DISTINCT certification 
FROM films;

In [ ]:
SELECT DISTINCT role
FROM roles;

### Learning to COUNT
What if you want to count the number of employees in your employees table? The COUNT() function lets you do this by returning the number of rows in one or more columns.

For example, this code gives the number of rows in the people table:

SELECT COUNT(*)

FROM people;

Instructions:

How many records are contained in the reviews table?

In [ ]:
SELECT COUNT(*)
FROM reviews;

### Practice with COUNT
As you've seen, COUNT(*) tells you how many rows are in a table. However, if you want to count the number of non-missing values in a particular column, you can call COUNT() on just that column.

For example, to count the number of birth dates present in the people table:

SELECT COUNT(birthdate)

FROM people;

It's also common to combine COUNT() with DISTINCT to count the number of distinct values in a column.

For example, this query counts the number of distinct birth dates contained in the people table:

SELECT COUNT(DISTINCT birthdate)

FROM people;

Let's get some practice with COUNT()!

Count the number of rows in the people table.

Instructions:

* Count the number of rows in the people table.
* Count the number of (non-missing) birth dates in the people table.
* Count the number of unique birth dates in the people table.
* Count the number of unique languages in the films table.
* Count the number of unique countries in the films table.

In [ ]:
SELECT COUNT(DISTINCT id)
FROM people;

In [ ]:
SELECT COUNT(birthdate)
FROM people;

In [ ]:
SELECT COUNT(DISTINCT birthdate)
FROM people;

In [ ]:
SELECT COUNT(DISTINCT language)
FROM films;

In [ ]:
SELECT COUNT(DISTINCT country)
FROM films;

## Filtering rows

### Simple filtering of numeric values
As you learned in the previous exercise, the WHERE clause can also be used to filter numeric records, such as years or ages.

For example, the following query selects all details for films with a budget over ten thousand dollars:

SELECT *

FROM films

WHERE budget > 10000;

Now it's your turn to use the WHERE clause to filter numeric values!

Instructions:

* Get all details for all films released in 2016.
* Get the number of films released before 2000.
* Get the title and release year of films released after 2000.

In [ ]:
SELECT *
FROM films
WHERE release_year = 2016;

In [ ]:
SELECT *
FROM films
WHERE release_year < 2000;

In [ ]:
SELECT COUNT(*)
FROM films
WHERE release_year < 2000;

In [ ]:
SELECT title,release_year
FROM films
WHERE release_year > 2000;

### Simple filtering of text
Remember, the WHERE clause can also be used to filter text results, such as names or countries.

For example, this query gets the titles of all films which were filmed in China:

SELECT title

FROM films

WHERE country = 'China';

Now it's your turn to practice using WHERE with text values!

Important: in PostgreSQL (the version of SQL we're using), you must use single quotes with WHERE.

Instructions 4/4

* Get all details for all French language films.
* Get the name and birth date of the person born on November 11th, 1974. Remember to use ISO date format ('1974-11-11')!
* Get the number of Hindi language films.
* Get all details for all films with an R certification.

In [ ]:
SELECT *
FROM films
WHERE language = 'French';

In [ ]:
SELECT name,birthdate
FROM people
WHERE birthdate = '1974-11-11';

In [ ]:
SELECT COUNT(*)
FROM films
WHERE language = 'Hindi';

In [ ]:
SELECT *
FROM films
WHERE certification = 'R';

### WHERE AND
Often, you'll want to select data based on multiple conditions. You can build up your WHERE queries by combining multiple conditions with the AND keyword.

For example,

SELECT title

FROM films

WHERE release_year > 1994

AND release_year < 2000;

gives you the titles of films released between 1994 and 2000.

Note that you need to specify the column name separately for every AND condition, so the following would be invalid:

SELECT title

FROM films

WHERE release_year > 1994 AND < 2000;

You can add as many AND conditions as you need!

Instructions:

* Get the title and release year for all Spanish language films released before 2000.
* Get all details for Spanish language films released after 2000.
* Get all details for Spanish language films released after 2000, but before 2010.

In [ ]:
SELECT title,release_year
FROM films
WHERE language = 'Spanish'
AND release_year < 2000;

In [ ]:
SELECT *
FROM films
WHERE language = 'Spanish'
AND release_year > 2000;

In [ ]:
SELECT *
FROM films
WHERE release_year > 2000
AND release_year < 2010
AND language = 'Spanish';

### WHERE AND OR (2)
You now know how to select rows that meet some but not all conditions by combining AND and OR.

For example, the following query selects all films that were released in 1994 or 1995 which had a rating of PG or R.

    SELECT title
    FROM films
    WHERE (release_year = 1994 OR release_year = 1995)
    AND (certification = 'PG' OR certification = 'R');
Now you'll write a query to get the title and release year of films released in the 90s which were in French or Spanish and which took in more than $2M gross.

It looks like a lot, but you can build the query up one step at a time to get comfortable with the underlying concept in each step. Let's go!

Instructions:

* Get the title and release year for films released in the 90s.
* Now, build on your query to filter the records to only include French or Spanish language films.
* Finally, restrict the query to only return films that took in more than $2M gross.

In [ ]:
SELECT title,release_year
FROM films
WHERE (release_year >=1990  AND release_year < 2000)

In [ ]:
SELECT title,release_year
FROM films
WHERE (release_year >=1990  AND release_year < 2000)
AND (language = 'French' OR language ='Spanish')

In [ ]:
SELECT title, release_year
FROM films
WHERE (release_year >= 1990 AND release_year < 2000)
AND (language = 'French' OR language = 'Spanish')
AND (gross>2000000)

### BETWEEN (2)
Similar to the WHERE clause, the BETWEEN clause can be used with multiple AND and OR operators, so you can build up your queries and make them even more powerful!

For example, suppose we have a table called kids. We can get the names of all kids between the ages of 2 and 12 from the United States:

    SELECT name
    FROM kids
    WHERE age BETWEEN 2 AND 12
    AND nationality = 'USA';

Take a go at using BETWEEN with AND on the films data to get the title and release year of all Spanish language films released between 1990 and 2000 (inclusive) with budgets over $100 million. We have broken the problem into smaller steps so that you can build the query as you go along!

Instructions:

* Get the title and release year of all films released between 1990 and 2000 (inclusive).
* Now, build on your previous query to select only films that have budgets over $100 million.
* Now restrict the query to only return Spanish language films.
* Finally, modify to your previous query to include all Spanish language or French language films with the same criteria as before. Don't forget your parentheses!

In [ ]:
SELECT title,release_year
FROM films
WHERE release_year BETWEEN 1990 AND 2000

In [ ]:
SELECT title, release_year
FROM films
WHERE release_year BETWEEN 1990 AND 2000
AND budget > 100000000

In [ ]:
SELECT title, release_year
FROM films
WHERE release_year BETWEEN 1990 AND 2000
AND budget > 100000000
AND language = 'Spanish'

In [ ]:
SELECT title, release_year
FROM films
WHERE release_year BETWEEN 1990 AND 2000
AND budget > 100000000
AND (language = 'Spanish' OR language = 'French');

### WHERE IN
As you've seen, WHERE is very useful for filtering results. However, if you want to filter based on many conditions, WHERE can get unwieldy. For example:

    SELECT name
    FROM kids
    WHERE age = 2
    OR age = 4
    OR age = 6
    OR age = 8
    OR age = 10;
    
Enter the IN operator! The IN operator allows you to specify multiple values in a WHERE clause, making it easier and quicker to specify multiple OR conditions! Neat, right?

So, the above example would become simply:

    SELECT name
    FROM kids
    WHERE age IN (2, 4, 6, 8, 10);
    
Try using the IN operator yourself!

Instructions:
* Get the title and release year of all films released in 1990 or 2000 that were longer than two hours. Remember, duration is in minutes!
* Get the title and language of all films which were in English, Spanish, or French.
* Get the title and certification of all films with an NC-17 or R certification.

In [ ]:
SELECT title,release_year
FROM films
WHERE release_year IN (1990, 2000)
AND duration > 120;

In [ ]:
SELECT title,language
FROM films
WHERE language IN ('English','Spanish','French')

In [ ]:
SELECT title,certification
FROM films
WHERE certification IN ('NC-17','R')

### NULL and IS NULL
Now that you know what NULL is and what it's used for, it's time for some practice!

Instructions:

Instructions:

* Get the names of people who are still alive, i.e. whose death date is missing.
* Get the title of every film which doesn't have a budget associated with it.
* Get the number of films which don't have a language associated with them.

In [ ]:
SELECT name
FROM people
WHERE deathdate IS NULL;

In [ ]:
SELECT title
FROM films
WHERE budget IS NULL;

In [ ]:
SELECT COUNT (*)
FROM films
WHERE language IS NULL;

### LIKE and NOT LIKE
As you've seen, the WHERE clause can be used to filter text data. However, so far you've only been able to filter by specifying the exact text you're interested in. In the real world, often you'll want to search for a pattern rather than a specific text string.

In SQL, the LIKE operator can be used in a WHERE clause to search for a pattern in a column. To accomplish this, you use something called a wildcard as a placeholder for some other values. There are two wildcards you can use with LIKE:

The % wildcard will match zero, one, or many characters in text. For example, the following query matches companies like 'Data', 'DataC' 'DataCamp', 'DataMind', and so on:

    SELECT name
    FROM companies
    WHERE name LIKE 'Data%';
The _ wildcard will match a single character. For example, the following query matches companies like 'DataCamp', 'DataComp', and so on:

    SELECT name
    FROM companies
    WHERE name LIKE 'DataC_mp';
You can also use the NOT LIKE operator to find records that don't match the pattern you specify.

Got it? Let's practice!

Instructions:

* Get the names of all people whose names begin with 'B'. The pattern you need is 'B%'.
* Get the names of people whose names have 'r' as the second letter. The pattern you need is '_r%'.
* Get the names of people whose names don't start with A. The pattern you need is 'A%'.

In [ ]:
SELECT name
FROM people
WHERE name LIKE 'B%';

In [ ]:
SELECT name
FROM people
WHERE name LIKE '_r%';

In [ ]:
SELECT name
FROM people
WHERE name NOT LIKE 'A%';

## Aggregate Functions
This chapter teaches you how to use aggregate functions to summarize data and gain useful insights. You'll also learn about arithmetic in SQL and how to use aliases to make your results more readable.

### Aggregate functions
Often, you will want to perform some calculation on the data in a database. SQL provides a few functions, called aggregate functions, to help you out with this.

For example,

    SELECT AVG(budget)
    FROM films;
gives you the average value from the budget column of the films table. Similarly, the MAX() function returns the highest budget:

    SELECT MAX(budget)
    FROM films;
The SUM() function returns the result of adding up the numeric values in a column:

    SELECT SUM(budget)
    FROM films;
You can probably guess what the MIN() function does! Now it's your turn to try out some SQL functions.

Instructions:

* Use the SUM() function to get the total duration of all films.
* Get the average duration of all films.
* Get the duration of the shortest film.
* Get the duration of the longest film.

In [ ]:
SELECT SUM(duration)
FROM films;

In [ ]:
SELECT AVG(duration)
FROM films;

In [ ]:
SELECT MIN(duration)
FROM films;

In [ ]:
SELECT MAX(duration)
FROM films;

### Aggregate functions practice
Good work. Aggregate functions are important to understand, so let's get some more practice!

Instructions:

* Use the SUM() function to get the total amount grossed by all films.
* Get the average amount grossed by all films.
* Get the amount grossed by the worst performing film.
* Get the amount grossed by the best performing film.

In [ ]:
SELECT SUM(gross)
FROM films;

In [ ]:
SELECT AVG(gross)
FROM films;

In [ ]:
SELECT MIN(gross)
FROM films;

In [ ]:
SELECT MAX(gross)
FROM films;

### Combining aggregate functions with WHERE
Aggregate functions can be combined with the WHERE clause to gain further insights from your data.

For example, to get the total budget of movies made in the year 2010 or later:

    SELECT SUM(budget)
    FROM films
    WHERE release_year >= 2010;
Now it's your turn!

Instructions:

* Use the SUM() function to get the total amount grossed by all films made in the year 2000 or later.
* Get the average amount grossed by all films whose titles start with the letter 'A'.
* Get the amount grossed by the worst performing film in 1994.
* Get the amount grossed by the best performing film between 2000 and 2012, inclusive.

In [ ]:
SELECT SUM(gross)
FROM films
WHERE release_year >= 2000;

In [ ]:
SELECT AVG(gross)
FROM films
WHERE title LIKE 'A%';

In [ ]:
SELECT MIN(gross)
FROM films
WHERE release_year = 1994;

In [ ]:
SELECT MAX(gross)
FROM films
WHERE release_year BETWEEN 2000 AND 2012;

### A note on arithmetic
In addition to using aggregate functions, you can perform basic arithmetic with symbols like +, -, *, and /.

So, for example, this gives a result of 12:

    SELECT (4 * 3);
However, the following gives a result of 1:

    SELECT (4 / 3);
What's going on here?

SQL assumes that if you divide an integer by an integer, you want to get an integer back. So be careful when dividing!

If you want more precision when dividing, you can add decimal places to your numbers. For example,

    SELECT (4.0 / 3.0) AS result;
gives you the result you would expect: 1.333.

### It's AS simple AS aliasing
You may have noticed in the first exercise of this chapter that the column name of your result was just the name of the function you used. For example,

    SELECT MAX(budget)
    FROM films;
gives you a result with one column, named max. But what if you use two functions like this?

    SELECT MAX(budget), MAX(duration)
    FROM films;
Well, then you'd have two columns named max, which isn't very useful!

To avoid situations like this, SQL allows you to do something called aliasing. Aliasing simply means you assign a temporary name to something. To alias, you use the AS keyword, which you've already seen earlier in this course.

For example, in the above example we could use aliases to make the result clearer:

    SELECT MAX(budget) AS max_budget,
           MAX(duration) AS max_duration
FROM films;
Aliases are helpful for making results more readable!

Instructions:

* Get the title and net profit (the amount a film grossed, minus its budget) for all films. Alias the net profit as net_profit.
* Get the title and duration in hours for all films. The duration is in minutes, so you'll need to divide by 60.0 to get the duration in hours. Alias the duration in hours as duration_hours.
* Get the average duration in hours for all films, aliased as avg_duration_hours.

In [ ]:
SELECT title,(gross - budget) AS net_profit
FROM films;

In [ ]:
SELECT title, (duration/60.0) AS duration_hours
FROM films;

In [ ]:
SELECT AVG(duration)/60.0 AS avg_duration_hours
FROM films;

Even more aliasing
Let's practice your newfound aliasing skills some more before moving on!

Recall: SQL assumes that if you divide an integer by an integer, you want to get an integer back.

This means that the following will erroneously result in 400.0:

    SELECT 45 / 10 * 100.0;
This is because 45 / 10 evaluates to an integer (4), and not a decimal number like we would expect.

So when you're dividing make sure at least one of your numbers has a decimal place:

    SELECT 45 * 100.0 / 10;
The above now gives the correct answer of 450.0 since the numerator (45 * 100.0) of the division is now a decimal!

Instructions:

* Get the percentage of people who are no longer alive. Alias the result as percentage_dead. Remember to use 100.0 and not 100!
* Get the number of years between the newest film and oldest film. Alias the result as difference.
* Get the number of decades the films table covers. Alias the result as number_of_decades. The top half of your fraction should be enclosed in parentheses.

In [ ]:
SELECT COUNT(deathdate) * 100.0 / COUNT(*) AS percentage_dead
FROM people;

In [ ]:
SELECT (MAX(release_year) - MIN(release_year)) AS difference
FROM films;

In [ ]:
SELECT (MAX(release_year)-MIN(release_year))/10.0 AS number_of_decades
FROM films;

## Sorting and grouping
This chapter provides a brief introduction to sorting and grouping your results.

### Sorting single columns
Now that you understand how ORDER BY works, give these exercises a go!

Instructions:

* Get the names of people from the people table, sorted alphabetically.
* Get the names of people, sorted by birth date.
* Get the birth date and name for every person, in order of when they were born.

In [ ]:
SELECT name
FROM people
ORDER BY name;

In [ ]:
SELECT name
FROM people
ORDER BY birthdate;

In [ ]:
SELECT birthdate,name
FROM people
ORDER BY birthdate;

### Sorting single columns (2)
Let's get some more practice with ORDER BY!

Instructions:

* Get the title of films released in 2000 or 2012, in the order they were released.
* Get all details for all films except those released in 2015 and order them by duration.
* Get the title and gross earnings for movies which begin with the letter 'M' and order the results alphabetically.

In [ ]:
SELECT title
FROM films 
WHERE release_year IN (2000,2012)
ORDER BY release_year;

In [ ]:
SELECT *
FROM films
WHERE release_year <> 2015
ORDER BY duration;

In [ ]:
SELECT title,gross
FROM films
WHERE title LIKE 'M%'
ORDER BY title;

### Sorting single columns (DESC)
To order results in descending order, you can put the keyword DESC after your ORDER BY. For example, to get all the names in the people table, in reverse alphabetical order:

    SELECT name
    FROM people
    ORDER BY name DESC;
Now practice using ORDER BY with DESC to sort single columns in descending order!

Instructions:

* Get the IMDB score and film ID for every film from the reviews table, sorted from highest to lowest score.
* Get the title for every film, in reverse order.
* Get the title and duration for every film, in order of longest duration to shortest.

In [ ]:
SELECT imdb_score,film_id
FROM reviews
ORDER BY imdb_score DESC;

In [ ]:
SELECT title
FROM films
ORDER BY title DESC;

In [ ]:
SELECT title,duration
FROM films
ORDER BY duration DESC;

### Sorting multiple columns
ORDER BY can also be used to sort on multiple columns. It will sort by the first column specified, then sort by the next, then the next, and so on. For example,

    SELECT birthdate, name
    FROM people
    ORDER BY birthdate, name;
sorts on birth dates first (oldest to newest) and then sorts on the names in alphabetical order. The order of columns is important!

Try using ORDER BY to sort multiple columns! Remember, to specify multiple columns you separate the column names with a comma.

Instructions:

* Get the birth date and name of people in the people table, in order of when they were born and alphabetically by name.
* Get the release year, duration, and title of films ordered by their release year and duration.
* Get certifications, release years, and titles of films ordered by certification (alphabetically) and release year.
* Get the names and birthdates of people ordered by name and birth date.

In [ ]:
SELECT birthdate, name
FROM people
ORDER BY birthdate, name;

In [ ]:
SELECT release_year,duration,title
FROM films
ORDER BY release_year, duration;

In [ ]:
SELECT certification,release_year,title
FROM films
ORDER BY certification, release_year;

In [ ]:
SELECT name,birthdate
FROM people
ORDER BY name, birthdate;

### GROUP BY practice
As you've just seen, combining aggregate functions with GROUP BY can yield some powerful results!

A word of warning: SQL will return an error if you try to SELECT a field that is not in your GROUP BY clause without using it to calculate some kind of value about the entire group.

Note that you can combine GROUP BY with ORDER BY to group your results, calculate something about them, and then order your results. For example,

    SELECT sex, count(*)
    FROM employees
    GROUP BY sex
    ORDER BY count DESC;
might return something like

    sex	count
    female	19
    male	15

because there are more females at our company than males. Note also that ORDER BY always goes after GROUP BY. Let's try some exercises!

Instructions:

* Get the release year and count of films released in each year.
* Get the release year and average duration of all films, grouped by release year.
* Get the release year and largest budget for all films, grouped by release year.
* Get the IMDB score and count of film reviews grouped by IMDB score in the reviews table.

In [ ]:
SELECT release_year, COUNT(*)
FROM films
GROUP BY release_year;

In [ ]:
SELECT release_year, AVG(duration)
FROM films
GROUP BY release_year;

In [ ]:
SELECT release_year, MAX(budget)
FROM films
GROUP BY release_year;

In [ ]:
SELECT imdb_score, COUNT(*)
FROM reviews
GROUP BY imdb_score;

### GROUP BY practice (2)
Now practice your new skills by combining GROUP BY and ORDER BY with some more aggregate functions!

Make sure to always put the ORDER BY clause at the end of your query. You can't sort values that you haven't calculated yet!

Instructions: 
* Get the release year and lowest gross earnings per release year.
* Get the language and total gross amount films in each language made.
* Get the country and total budget spent making movies in each country.
* Get the release year, country, and highest budget spent making a film for each year, for each country. Sort your results by release year and country.
* Get the country, release year, and lowest amount grossed per release year per country. Order your results by country and release year.

In [ ]:
SELECT release_year,MIN(gross)
FROM films
GROUP BY release_year;

In [ ]:
SELECT language,SUM(gross)
FROM films
GROUP BY language;

In [ ]:
SELECT country,SUM(budget)
FROM films
GROUP BY country;

In [ ]:
SELECT release_year, country, MAX(budget)
FROM films
GROUP BY release_year, country
ORDER BY release_year, country;

In [ ]:
SELECT country,release_year,MIN(gross)
FROM films
GROUP BY release_year, country
ORDER BY country, release_year;

### HAVING a great time
In SQL, aggregate functions can't be used in WHERE clauses. For example, the following query is invalid:

    SELECT release_year
    FROM films
    GROUP BY release_year
    WHERE COUNT(title) > 10;
This means that if you want to filter based on the result of an aggregate function, you need another way! That's where the HAVING clause comes in. For example,

    SELECT release_year
    FROM films
    GROUP BY release_year
    HAVING COUNT(title) > 10;
shows only those years in which more than 10 films were released.

Instructions:

* Get the release year, budget and gross earnings for each film in the films table.
* Modify your query so that only records with a release_year after 1990 are included.
* Remove the budget and gross columns, and group your results by release year.
* Modify your query to include the average budget and average gross earnings for the results you have so far. Alias the average budget as avg_budget; alias the average gross earnings as avg_gross.
* Modify your query so that only years with an average budget of greater than $60 million are included.
* Finally, modify your query to order the results from highest average gross earnings to lowest.

In [ ]:
SELECT release_year,budget,gross
FROM films;

In [ ]:
SELECT release_year
FROM films
WHERE release_year > 1990;

In [ ]:
SELECT release_year
FROM films
WHERE release_year > 1990
GROUP BY release_year;

In [ ]:
SELECT release_year, AVG(budget) AS avg_budget, AVG(gross) AS avg_gross
FROM films
WHERE release_year > 1990
GROUP BY release_year;

In [ ]:
SELECT release_year, AVG(budget) AS avg_budget, AVG(gross) AS avg_gross
FROM films
WHERE release_year > 1990
GROUP BY release_year
HAVING AVG(budget) > 60000000;

In [ ]:
SELECT release_year, AVG(budget) AS avg_budget, AVG(gross) AS avg_gross
FROM films
WHERE release_year > 1990
GROUP BY release_year
HAVING AVG(budget) > 60000000
ORDER BY avg_gross DESC;

### All together now (2)
Great work! Now try another large query. This time, all in one go!

Remember, if you only want to return a certain number of results, you can use the LIMIT keyword to limit the number of rows returned

Instructions:

* Get the country, average budget, and average gross take of countries that have made more than 10 films. Order the result by country name, and limit the number of results displayed to 5. You should alias the averages as avg_budget and avg_gross respectively.

In [ ]:
SELECT country, AVG(budget) AS avg_budget, 
       AVG(gross) AS avg_gross
FROM films
GROUP BY country
HAVING COUNT(title) > 10
ORDER BY country
LIMIT 5;